---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RepeatingReferenceSource Properties
RepeatingReferenceSource Class See Also Send Feedback
---

The RepeatingReferenceSource type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | DimensionCount | The dimension count of the repeating reference array. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RepeatingReferenceSource Class

Autodesk.Revit.DB Namespace